; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v5)
             (pred_1 ?v4 ?v1)
             (pred_5 ?v2 ?v1)
             (pred_4 ?v3 ?v2 )
	     (pred_8 ?v2)
             (pred_9 ?v8)
             (pred_11 ?v4)
             (pred_12 ?v1)
             (pred_2 ?v2)
             (pred_6 ?v4)
             (pred_7 ?v2)
             (pred_10 ))



(:action op_4
:parameters (?v9 ?v6 ?v11 ?v10)
:precondition (and (pred_9 ?v9) (pred_9 ?v6) (pred_11 ?v11) (pred_12 ?v10)
          (pred_3 ?v9 ?v6) (pred_1 ?v11 ?v10)
                   (pred_5 ?v6 ?v10) (pred_8 ?v9) 
                   (pred_2 ?v6) (pred_6 ?v11))
:effect (and  (pred_7 ?v6) (not (pred_2 ?v6))))


(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_9 ?v9) (pred_9 ?v7)
               (pred_8 ?v9) (pred_3 ?v9 ?v7) (pred_7 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v9))))

(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_11 ?v11) 
                  (pred_8 ?v9) (pred_4 ?v11 ?v9) (pred_10 ))
:effect (and (pred_6 ?v11)
   (not (pred_4 ?v11 ?v9)) (not (pred_10 ))))


(:action op_1
:parameters (?v9 ?v12 ?v13)
:precondition (and (pred_9 ?v9) (pred_11 ?v12) (pred_11 ?v13)
                  (pred_8 ?v9) (pred_6 ?v13) (pred_4 ?v12 ?v9))
:effect (and (pred_6 ?v12) (pred_4 ?v13 ?v9)
        (not (pred_6 ?v13)) (not (pred_4 ?v12 ?v9))))

(:action op_5
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_11 ?v11) 
                  (pred_8 ?v9) (pred_6 ?v11))
:effect (and (pred_10 ) (pred_4 ?v11 ?v9) (not (pred_6 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_17 obj_05 obj_16 obj_14 obj_19 obj_24 obj_22 obj_23 obj_02 obj_11 obj_20 obj_09 obj_08 obj_03 obj_21 obj_12 obj_25 obj_04 obj_30 obj_15 obj_31 obj_06 obj_26 obj_18
    obj_28 obj_27 obj_01
    obj_07 obj_10 obj_13
    )

    (:init
       (pred_10)

       (pred_9 obj_29)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_24)
       (pred_9 obj_22)
       (pred_9 obj_23)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_20)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_12)
       (pred_9 obj_25)
       (pred_9 obj_04)
       (pred_9 obj_30)
       (pred_9 obj_15)
       (pred_9 obj_31)
       (pred_9 obj_06)
       (pred_9 obj_26)
       (pred_9 obj_18)
       (pred_12 obj_28)
       (pred_12 obj_27)
       (pred_12 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_13)

       (pred_3 obj_29 obj_19)
       (pred_3 obj_29 obj_17)
       (pred_3 obj_17 obj_24)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_17 obj_29)
       (pred_3 obj_05 obj_22)
       (pred_3 obj_05 obj_16)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_05)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_24)
       (pred_3 obj_19 obj_29)
       (pred_3 obj_24 obj_20)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_17)
       (pred_3 obj_24 obj_19)
       (pred_3 obj_22 obj_09)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_05)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_23 obj_02)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_23)
       (pred_3 obj_11 obj_21)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_24)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_09 obj_25)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_22)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_03 obj_30)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_21 obj_12)
       (pred_3 obj_21 obj_11)
       (pred_3 obj_12 obj_31)
       (pred_3 obj_12 obj_25)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_21)
       (pred_3 obj_25 obj_06)
       (pred_3 obj_25 obj_04)
       (pred_3 obj_25 obj_09)
       (pred_3 obj_25 obj_12)
       (pred_3 obj_04 obj_26)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_25)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_30 obj_03)
       (pred_3 obj_30 obj_04)
       (pred_3 obj_15 obj_31)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_31 obj_06)
       (pred_3 obj_31 obj_12)
       (pred_3 obj_31 obj_15)
       (pred_3 obj_06 obj_26)
       (pred_3 obj_06 obj_25)
       (pred_3 obj_06 obj_31)
       (pred_3 obj_26 obj_18)
       (pred_3 obj_26 obj_04)
       (pred_3 obj_26 obj_06)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_18 obj_26)
       (pred_2 obj_11)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_5  obj_11 obj_28)
       (pred_5  obj_05 obj_27)
       (pred_5  obj_17 obj_01)
       (pred_7 obj_29)
       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_19)
       (pred_7 obj_24)
       (pred_7 obj_22)
       (pred_7 obj_23)
       (pred_7 obj_02)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_21)
       (pred_7 obj_12)
       (pred_7 obj_25)
       (pred_7 obj_04)
       (pred_7 obj_30)
       (pred_7 obj_15)
       (pred_7 obj_31)
       (pred_7 obj_06)
       (pred_7 obj_26)
       (pred_7 obj_18)

       (pred_1  obj_07 obj_28)
       (pred_1  obj_10 obj_27)
       (pred_1  obj_13 obj_01)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_10 obj_24)
       (pred_4 obj_13 obj_14)
       (pred_8 obj_23)
    )

    (:goal (and
       (pred_4 obj_07 obj_26)
       (pred_4 obj_10 obj_30)
       (pred_4 obj_13 obj_15)
    ))
(:constraints
  (always (not (pred_8 obj_04)))
)
)

; plan
1. (op_3 obj_23 obj_22)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_22)
   goals met: 0 of 3
2. (op_3 obj_22 obj_09)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_09)
   goals met: 0 of 3
3. (op_2 obj_09 obj_07)
   deleted: (pred_4 obj_07 obj_09) (pred_10)
   added: (pred_6 obj_07)
   goals met: 0 of 3
4. (op_3 obj_09 obj_25)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_25)
   goals met: 0 of 3
5. (op_3 obj_25 obj_06)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_06)
   goals met: 0 of 3
6. (op_3 obj_06 obj_26)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_26)
   goals met: 0 of 3
7. (op_5 obj_26 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_10) (pred_4 obj_07 obj_26)
   goals met: 1 of 3
8. (op_3 obj_26 obj_18)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_18)
   goals met: 1 of 3
9. (op_3 obj_18 obj_30)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_30)
   goals met: 1 of 3
10. (op_3 obj_30 obj_03)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_03)
   goals met: 1 of 3
11. (op_3 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 1 of 3
12. (op_3 obj_02 obj_23)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_23)
   goals met: 1 of 3
13. (op_3 obj_23 obj_22)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_22)
   goals met: 1 of 3
14. (op_3 obj_22 obj_24)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_24)
   goals met: 1 of 3
15. (op_2 obj_24 obj_10)
   deleted: (pred_4 obj_10 obj_24) (pred_10)
   added: (pred_6 obj_10)
   goals met: 1 of 3
16. (op_3 obj_24 obj_22)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_22)
   goals met: 1 of 3
17. (op_3 obj_22 obj_23)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_23)
   goals met: 1 of 3
18. (op_3 obj_23 obj_02)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_02)
   goals met: 1 of 3
19. (op_3 obj_02 obj_03)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_03)
   goals met: 1 of 3
20. (op_3 obj_03 obj_30)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_30)
   goals met: 1 of 3
21. (op_5 obj_30 obj_10)
   deleted: (pred_6 obj_10)
   added: (pred_10) (pred_4 obj_10 obj_30)
   goals met: 2 of 3
22. (op_3 obj_30 obj_03)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_03)
   goals met: 2 of 3
23. (op_3 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 2 of 3
24. (op_3 obj_02 obj_14)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_14)
   goals met: 2 of 3
25. (op_2 obj_14 obj_13)
   deleted: (pred_4 obj_13 obj_14) (pred_10)
   added: (pred_6 obj_13)
   goals met: 2 of 3
26. (op_3 obj_14 obj_16)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_16)
   goals met: 2 of 3
27. (op_3 obj_16 obj_23)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_23)
   goals met: 2 of 3
28. (op_3 obj_23 obj_22)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_22)
   goals met: 2 of 3
29. (op_3 obj_22 obj_24)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_24)
   goals met: 2 of 3
30. (op_3 obj_24 obj_20)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_20)
   goals met: 2 of 3
31. (op_3 obj_20 obj_12)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_12)
   goals met: 2 of 3
32. (op_3 obj_12 obj_21)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_21)
   goals met: 2 of 3
33. (op_3 obj_21 obj_15)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_15)
   goals met: 2 of 3
34. (op_5 obj_15 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_10) (pred_4 obj_13 obj_15)
   goals met: 3 of 3
